In [1]:
import pandas as pd

In [2]:
account = {
    "student_ID": [100, 101, 201, 331],
    "first_name": ["Ayush", "Ryan", "Chisato", "Isabelle"],
    "last_name": ["Adhikari", "Griffin", "Nii", "Bui"],
    "University": ["CSU", "CSU", "CSU", "DU"],
    "Major": ["CIS", "CS", "Piano", "Nutrition"],
    "Salary": [200000, 100000, 50000, 75000],
    "Age": [21, 22, 30, 20],
    "GPA": [4.0, 4.0, 3.5, 3.8],
}

In [3]:
df = pd.DataFrame(account)

In [4]:
df

   student_ID first_name last_name University      Major  Salary  Age  GPA
0         100      Ayush  Adhikari        CSU        CIS  200000   21  4.0
1         101       Ryan   Griffin        CSU         CS  100000   22  4.0
2         201    Chisato       Nii        CSU      Piano   50000   30  3.5
3         331   Isabelle       Bui         DU  Nutrition   75000   20  3.8

In [5]:
filt = (df["last_name"] == "Adhikari")

In [6]:
print(filt)

0     True
1    False
2    False
3    False
Name: last_name, dtype: bool

In [7]:
df[filt]

   student_ID first_name last_name University Major  Salary  Age  GPA
0         100      Ayush  Adhikari        CSU   CIS  200000   21  4.0

In [8]:
df.loc[filt, ["first_name", "Salary"]]

  first_name  Salary
0      Ayush  200000

In [9]:
filt_2 = (df["University"] != "CSU") & (df["Salary"] > 50000)

In [10]:
df.loc[~filt_2]

   student_ID first_name last_name University  Major  Salary  Age  GPA
0         100      Ayush  Adhikari        CSU    CIS  200000   21  4.0
1         101       Ryan   Griffin        CSU     CS  100000   22  4.0
2         201    Chisato       Nii        CSU  Piano   50000   30  3.5

In [14]:
df_public = pd.read_csv("survey_results_public.csv")

In [37]:
filt_public = (df_public["ConvertedComp"] >= 100000) & (df_public["Country"].isin(country_interested))

In [24]:
country_interested = ["United States", "United Kingdom", "Canada"]

In [45]:
df_public.loc[filt_public, ["Country"]]

              Country
7       United States
15     United Kingdom
17      United States
40      United States
41      United States
...               ...
64083   United States
64113   United States
64116   United States
64127   United States
64129   United States

[6122 rows x 1 columns]

In [73]:
filt_2 = df_public["LanguageWorkedWith"].str.contains("Kotlin", na = False)

In [74]:
df_public.loc[filt_2, "LanguageWorkedWith"]

15       Bash/Shell/PowerShell;HTML/CSS;Java;JavaScript...
23               Bash/Shell/PowerShell;Java;Kotlin;PHP;SQL
51                                             Java;Kotlin
87                 Bash/Shell/PowerShell;C++;Kotlin;Python
117      Bash/Shell/PowerShell;C#;Go;HTML/CSS;Java;Java...
                               ...
64426    Assembly;C;C++;Dart;HTML/CSS;Java;Kotlin;Pytho...
64429             Dart;JavaScript;Kotlin;Python;TypeScript
64432    Bash/Shell/PowerShell;C;C++;Go;HTML/CSS;JavaSc...
64445    Bash/Shell/PowerShell;C#;C++;HTML/CSS;JavaScri...
64457    Assembly;Bash/Shell/PowerShell;C;C#;C++;Dart;G...
Name: LanguageWorkedWith, Length: 4468, dtype: object